<template>
<NetflixApp v-if="isAllowed" />
<TerminalApp  @contextmenu.prevent="contextmenu" v-if="isAllowed && !isGaming" />
<NooApp v-if="!isAllowed"/>
</template>

<script>
import NetflixApp from './components/Netflix.vue'
import TerminalApp from './components/Terminal.vue'
import NooApp from './components/Noo.vue'

export default {
  name: 'App',
  components: {
    NetflixApp,
    TerminalApp,
    NooApp
    
  },
  data() {
    return {
      isAllowed: true,
      isGaming:false
    };
  },
  mounted() {
    this.checkScreenWidth();
    window.addEventListener('resize', this.checkScreenWidth);
  },
  beforeDestroy() {
    window.removeEventListener('resize', this.checkScreenWidth);
  },

  methods: {
    toggleGame(){
      return this.isGaming
    },
    contextmenu(e){
      e.preventDefault()
    },
    checkScreenWidth() {
      // Set your desired width limit
      const maxWidth = 848; // Example: Restrict access below 768 pixels

      this.isAllowed = window.innerWidth >= maxWidth;
    },
  },
    created() {
      let files=['donot.readme','aasoft.ir','projects.me','hack.me','virus.vbs']

      let frameAnimation
      let frames=[
        `

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
&&&&&&&&&&&&&&&&&&$$$$$$$$$$$$$$$XXXXXXXXXXXXxXXxxxxxxxxxxxxxxxxxxxxxXXXXXXXXXXXXXX$$$$$$$$$$$$$&&&&&&&&&&&&&&&&&&&&&         
&&&&&&&&&&&&&&&$$$$$$$$$$$$XXXXXXXXXXXxxxxxxxxxxxxx++++x+++x+xx+xxxxxxxxxxxxxxXXXXXXXXXX$$$$$$$$$$$&$&&&&&&&&&&&&&&&&         
&&&&&&&&&&&&&$$$$$$$$$$XXXXXXXXxxxxxxxxxxx+++++++++++++&$&$$$++++++++++++++xxxxxxxxxXXXXXXXXX$$$$$$$$$&&&&&&&&&&&&&&&         
&&&&&&&&&&&$$$$$$$$$XXXXXXXXxxxxxxxxx++++++++++++;++&&&&$$X$XXXX;;;;;;++++++++++xxxxxxxxxXXXXXXX$$$$$$$$$&&&&&&&&&&&&         
&&&&&&&&&$$$$$$$$$XXXXXXxxxxxxxxx+++++++;;;;;;;;;;&&&&&$$&XXXXXXXX:;;;;;;;;;;;+++++++xxxxxxxXXXXXXX$$$$$$$&&&&&&&&&&&         
&&&&&&&$$$$$$$$XXXXXXXXxxxxxxx++++++++;;;;;;;;;;+&&&&&&&&$XxXXXXXxX:::::::;;;;;;;++++++++xxxxxxXXXXXX$$$$$$$$&&&&&&&&         
&&&&&$$$$$$$$$XXXXXXXxxxxxxx+++++++;;;;;;;;;;;;;&&$&&$$&&$&XXxXXxXXX::::::::::;;;;;;+++++++xxxxxxXXXXXX$$$$$$$$&&&&&&         
&&&&&$$$$$$$XXXXXXXxxxxxxx++++++++;;;;;;;;:;;;;;&&&&&&$$XX$+x+xXxxxxx..::::::::::;;;;;;++++++xxxxxxXXXXXX$$$$$$&$&&&&         
&&&&$$$$$$$XXXXXXXxxxxxxx++++++;;;;;;;;;;::;;;;$&$&&&&&&&&&&&&&&&&&$$X::.::.:::::::;;;;;;++++++xxxxxxXXXXX$$$$$$$$&&&         
&&&$$$$$$$XXXXXXXxxxxxx++++++++;;;;;;;;;;;;::;&&&&&&&&&&&&&&&&&&&&&&&&$::...::::::::::;;;;;++++++xxxxxxXXXXX$$$$$$$&&         
&&$$$$$$$$XXXXXXxxxxxxxx+++++++;;;;;;;;;;;;;;&&&&&&&&&&&&&&&&&&&&&&&&&&X.......::::::::;;;;;++++++xxxxxxXXXXXX$$$$$$&         
&&$$$$$$$XXXXXXXxxxxxxx++++++++;;;;;;;;;;;;;;:&&&&&&&&&&&&&&&&&&&&&&&&&&........::::::::;;;;;;++++++xxxxxXXXXXX$$$$$$         
&$$$$$$$XXXXXXXxxxxxxx++++++++;+;;;;;;;;;;&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$.......:::::::::;;;;;;+++++xxxxxxXXXXXX$$$$$         
&$$$$$$$$XXXXXXxxxxxxxx+++++++++++++++&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$$X$$$$..::::::::::;;;;;;+++++xxxxxXXXXXX$$$$$         
&$$$$$$$$XXXXXXXxxxxxxx+++++++++++++&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$&$$$X$$$$:::::::::;:;;;;;+++++xxxxxxXXXXX$$$$$         
&$$$$$$$$XXXXXXXxxxxxxxx++++++++++&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$$&$$$&$$&$$$;::::::::;;;;;;++++++xxxxxxXXXXX$$$$         
&$$$$$$$$XXXXXXXxxxxxxxxxx+++++++&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&:::::::;;;;;;++++++xxxxxXXXXXX$$$$         
&&$$$$$$$$XXXXXXxXxxxxxxxxxx++++X&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$:::;;;;;;;;;++++++xxxxxxXXXXX$$$$         
&&&$$$$$$$XXXXXXXXXxxxxxxxxxxxx&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$;;;;;;;;+++++++xxxxxxXXXXX$$$$$         
&&&$$$$$$$$$XXXXXXXxxxxxxxxxxx&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$$;;;;;;++++++++xxxxxXXXXXX$$$$$         
&&&&$$$$$$$$$XXXXXXXXxxxxxxx$&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$$$$;;;++++++++xxxxxxXXXXXX$$$$$         
&&&&&$$$$$$$$$XXXXXXXXXXXxx&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$&&+++++++++xxxxxxXXXXXX$$$$$$         
&&&&&&&$$$$$$$$$XXXXXXXXX&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$$$$&&&&&+++++xxxxxxXXXXXX$$$$$$$$         
&&&&&&&&&$$$$$$$$$XXXXXXX&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$&$&&&&&&&x+xxxxxxxxXXXXXXX$$$$$$$&         
&&&&&&&&&&&$$$$$$$$$$$XXX&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$&&&&&&&xxxxxXXXXXXXX$$$$$$$$$&&         
&&&&&&&&&&&&$$XXXXXxxxxXxXXX$&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$;;;;;;;;;;;;++X$$$$$$$$$&&&&         
&&&&&&&&&$$$$$XXXXXXxXxxxxXxxxxXxXX&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&:::::::::::::::::;;++++x$$$$$$&&&&&         
&&&&&&&$$$$$$$$XXXXXXxxxxxxx+++x++X&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&$+;;;;;;;;;++++x;++++++XxxxX$&&&&&&&         
&&&&&&&&$&$$$$$$$$XXXXXXxXxxxx++xX&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&;;;;;;;;;;;;;++++xxxxxxxxxXXXXX&&&&&         
&&&&&&&&&&&&&&&$&$$$$$$$$$$$$&$$$$$$$$$$$$$$XXXXXXXXXXXXXXXXXXXXxXXXXXXXxxxxxxxxx++++++++++++xxxxxxxxxxxxxxXXXXXXXX&&         
&&&&&&&&&&&&&&&&&&&&&$$$$$$$$$$$$$$$XXXXXXXXXXXXXXXXXxXxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxXXXxxxXXXXXXXXXX$$$$$$         
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&         
&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              


    `,

`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
#################################+++++++++++++++++++++++++++++++++++++++++++++++++###################################         
###########################++++++++++++++++++++-+-------------------++-+++++++++++++++++#############################         
#######################+++++++++++++++-----------------######----------------+++++++++++++++#########################         
####################++++++++++++++------------------######+#++++------------------++++++++++++++#####################         
##################++++++++++++--------------------########++++++++.-------------------+++++++++++++##################         
###############+++++++++++++---------------------#########+++++++++.......----------------+++++++++++################         
##############++++++++++++----------------------###########+++++++++..........---------------++++++++++##############         
############++++++++++++------------------.-----########++#---+++++++............--------------++++++++++############         
###########+++++++++++-------------------..-.--######################+.............--------------+++++++++###########         
##########+++++++++++++-------------------..--#########################...............-------------+++++++++#########         
##########+++++++++++------------------------##########################+...............-------------+++++++++########         
#########+++++++++++------------------------..##########################................-------------++++++++++######         
########+#+++++++++++---------------------###############################................-------------+++++++++######         
#########+++++++++++------------------###################################+####............-------------+++++++++#####         
#########++++++++++++---------------#######################################+####.........-.------------+++++++++#####         
#########+++++++++++++------------###############################################-........-------------++++++++++####         
##########+++++++++++++----------##################################################.......-------------++++++++++####         
##########++++++++++++++--------+###################################################..-----------------++++++++++####         
##########++++++++++++++++-----#######################################################-----------------+++++++++#####         
############++++++++++++++++-+#########################################################----------------+++++++++#####         
#############+++++++++++++++#############################################################-------------+++++++++######         
##############+++++++++++++###############################################################----------+++++++++++######         
################+++++++++###################################################################------+++++++++++########         
##################+++++++###################################################################+----+++++++++++#########         
######################+++####################################################################-++++++++++++###########         
##############++++++++++++++#############################################################--------------+#############         
#############++++++++++++++++++++++###############################################.................-------###########         
###############++++++++++++-------+###############################################----------------------+++++########         
##################+++++++++++---++###############################################------------------+++++++++++++#####         
############################################+++++++++++++++++++++++++++++++++++----------------+--+-+++++++++++++++##         
###################################+++++++++++++++++++++++++++++++++++-+---+++-----+-++++++++++++++++++++++++++######         
#####################################################################################################################         
#####################################################################################################################         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
 
    `,

`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
ÆÆÆÆÅÅÅÅÅÅÅÅÅÅÅÅgÅgggggggGGGGGGGGÞÞÞÞÞÞÞÇÇÇÇÇÇÇÇÇ66666666666666666ÇÇÇÇÇÇÇÇÞÞÞÞÞÞÞÞGGGGGGggGggggggÅggÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅ         
ÅÅÅÅÅÅÅÅÅÅÅÅÅggggggggGGGGGGÞÞÞÞÞÞÇÇÇÇÇÇÇ6666666ü6üüüüüüüüüüüüüüüüüüü66ü66666ÇÇÇÇÇÇÞÞÞÞÞÞGGGGGGgggggÅggÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅ         
ÆÅÅÅÅÅÅÅÅÅÅgggggggGGGGGÞÞÞÞÞÇÇÇÇÇÇ6666üüüüüüüÏÏÏÏÏÏÏÏÏÏÅgÅggGÏÏÏÏÏÏÏÏÏüÏüüüüü66666ÇÇÇÇÇÞÞÞÞÞGGGGGGggggggÅÅÅÅÅÅÅÅÅÅÅÅÅ         
ÅÅÅÅÅÅÅÅÅggggggGGGGGÞÞÞÞÇÇÇÇÇ66666üüüüüÏÏÏÏÏzÏzzzzzÏÅÅÅgggÞGÇÞÞÞíízzzzzzzÏÏÏÏüÏüüü6666Ç6ÇÇÇÞÞÞÞÞGGGGGggggggÅÅÅÅÅÅÅÅÅÅ         
ÅÅÅÅÅÅgggggggGGGGGÞÞÞÞÇÇÇÇ6666üüüüüÏÏÏÏzzzzzzzzzzzÅÅÅggggÅÞÞÞÞÇÞÞÞ{ííííííízzzzzzÏÏüÏüü6666ÇÇÇÇÇÞÞÞÞGGGGgggggÅÅÅÅÅÅÅÅÅ         
ÅÅÅÅÅÅggggggGGGÞÞÞÞÇÇÇÇ66666üüüüÏÏÏÏÏzzzzzííííízzÆÆÆÅÅÅÅÅgÞÇÞÇÇÇÇ6Þ—{{{{{{ííííízzzÏÏÏÏÏüüü6666ÇÇÇÞÞÞÞGGGGggggggÅÅÅÅÅÅ         
ÅÅÅgggggggGGGGÞÞÞÇÇÇÇÇ6666üüüüÏÏÏÏzzzzzíííííííííÆÅGgÅGggÅGgÞÇÇÇÞÇÇÞÞ———{—{{{{{ííízzzzÏÏÏÏüüüü666ÇÇÇÇÞÞÞGGGGgggggÅÅÅÅÅ         
ÅÅÅÅggggGGGGÞÞÞÇÇÇÇÇ6666üüüüÏÏÏÏÏÏzzzíízíí{íííízÆÆÅÅÅÅgGÞÞGÏüÏ6Ç6ÇÇ6Ç›——————{{{{{íííízzzÏÏÏüüüü666ÇÇÇÞÇÞÞGGGggggggÅÅÅ         
ÅÅgggggGGGGÞÞÞÞÇÇÇÇ666üüüüüÏÏÏzzzzzíízííí{{í{íígÅgÅÆÆÆÆÆÆÅÅÆÆÆÆÆÆÆÅgGÇ—————————{{{{íííízzzÏÏÏÏüüü666ÇÇÇÞÞÞGGGGgggggÅÅ         
ÅÅggggGGGGÞÞÞÞÇÇÇÇ66666üüüÏÏÏÏzzzzíííííííí{{ííÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅÆÆÆÆÆg————›————{{{{{{íízzzzÏÏÏüüüü666ÇÇÇÞÞÞGGGGggggÅ         
ÅgggggGGGGÞÞÞÇÇÇ66666üüüüÏüÏÏzzzzzzzíííííííííÆÅÆÆÆÆÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÇ›—›—›—›————{{{{ííízzzzÏÏÏüüü666ÇÇÇÞÞÞGGGGgggg         
gÅgggGGGGÞÞÞÇÇÇÇÇ666üüüüÏüÏÏÏÏzzzzííízíííííí{{ÆÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅ—›››—›—›————{{{{íííízzzÏÏÏüüü666ÇÇÇÞÞÞÞGGgggg         
ÅggggGGGÞGÞÞÞÇÇÇ66666üüüÏÏÏÏzÏzzzzzzzzízííÆÆÆÆÆÅÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅGG—›››››—————{{{{{íííízzÏÏÏÏüüü666ÇÇÇÞÞÞGGGGgg         
gggggGGGGÞÞÞÇÇÇÇÇ666üüüüüüÏÏÏÏÏÏzÏzzzzÆÆÆÆÆÆÆÆÆÆÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆgGGGÞGGGG›———————{{{{íííízzzÏÏÏüüü666ÇÇÇÞÞÞGGgGg         
ÅggggGGGGÞÞÇÞÇÇÇ66666üüüüüÏÏÏÏzÏÏÏÏÏÆÆÆÆÆÆÆÆÆÆÆÆÆÅÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅGgGÅGGgÞGGGg————{{{{{í{íízzzÏÏÏüüüü6666ÇÇÞÞÞGGGgg         
gggggGGGGÞÞÞÞÇÇÇÇ66666üüüüüÏÏÏÏÏÏÏÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅÅÆÆÆÆÆÆÆÆÆÆÅÅÆGgGGggGGÆGgÅgGGí{{{{{{{{íííízzzÏÏÏüüü666ÇÇÇÇÞÞÞGGGg         
ÅggggGGGGGÞÞÞÇÇÇÇÇ66666üüüüüüÏÏüÏÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ{{{{{{{ííízzzzÏÏÏÏüü666ÇÇÇÇÞÞÞGGGg         
ÅÅggggGGGGÞÞÞÞÇÇÇÇ666666üüüüüüüüÞÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆG{{íííííízzzzzÏÏÏüüü6666ÇÇÇÞÞÞGGGg         
ÅgggggGGGGÞÞÞÞÇÇÇÇÇÇ666666üüüüüÅÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆggGííííízzzzzÏÏÏÏüüü666ÇÇÇÇÞÞGGGGg         
ÅÅgggggGGGGGÞÞÞÞÇÇÇ6ÇÇ666666ü6ÆÆÅÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆgGggíííízzzzÏÏÏÏüüüü666ÇÇÇÞÞÞGGGgg         
ÅÅÅgggggGGGGGÞÞÞÞÇÇÇÇÇÇ6Ç666gÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆggggggízzzÏzÏÏÏüüüü66ÇÇÇÇÞÞÞGGGgGg         
ÅÅÅÅgggggGGGGGÞÞÞÞÞÇÇÇÇÇÇÇ6ÆÆÅÅÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅÅÅgÆgzzÏÏÏÏÏüüü666ÇÇÇÇÞÞÞÞGGGggg         
ÅÅÅÅÅggggggGGGGGÞÞÞÞÞÇÇÇÇÆÆÆÆÆÆÅÆgÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆGgGGggÅÅÅÏÏüüüü6666ÇÇÇÇÞÞÞGGGGgggg         
ÅÅÅÅÅÅÅgggggggGGGGÞÞÞÞÞÞÞÆÆÆÆÆÆÆÆÆÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆgÅggÅÅÅÅÅÅ6üüüü6666ÇÇÇÇÞÞÞGGGGggggg         
ÅÅÅÅÅÅÅÅÅÅggggggGGGGGGÞÞÞÆÆÆÆÆÆÆÆÆÅÆÅÆÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÆÆÆÆÆÆÆÆÆÆÆÅÅÅggÅÅÅÅÆÆü666ÇÇÇÇÇÞÞÞÞGGGGGgggggÅ         
ÆÅÅÅÅÅÅÅÅÅÅgGGÞÇÇÇÇÇ666ÇÇÇÞÞgÆÆÆÆÆgÆÆÆÆÆÆÆÅÆÅÅÅÆÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅgÆÆÆÆÅÆgíííííízzízzzÏzÞGGGGggggggÅÅÅ         
ÆÅÆÅÅÅÅÅÅGgGGÞÞÞÇÞÇÇÇÇÇÇ66Ç6666ÇÇÇÇÆÆÆÆÆÆÆÆÅÅÆÆÆÆÅÆÆÆÆÆÆÅÆÅÅÆÆÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅgÅÅÅ————{—{{{—{{——{{{íízzÏüügggggggÅgÅÅ         
ÆÆÆÅÆÅÅggggGGGGÞÞÞÇÇÇÇ66Ç66üüüüüüüÇÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅÆÅÅÆÅÅÅÅÅÅÅgÏzízííííízzÏzüüzÏüüÏÏüÇ666ÇgggÅgÅÅÅ         
ÆÆÆÅÅÅÅggggggggGGGÞÞÞÞÇÇÇÇ666üüü6ÇÅÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÅzíííííííízzzzÏÏüüü6666666ÇÇÇÞÞÇÅÅÅÅÅ         
ÆÅÅÅÅÅÅÅÅÅÅÅgggggggggggggggggggggggggggGgGGGÞÞÞÞÞÞÞÇÞÇÞÇÇÇÞÞÞÇÇÇÇÇÞÞÇÇÇÇÇÇ66666üüÏÏÏÏÏÏÏÏüüüüüü6üü6ü6666ÇÇ6ÇÇÇÇÞÞÞÞÅÅ         
ÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅÅgÅgggggggggGGGGGGGGÞÞÞÞÞÞÞÞÞÞÇÞÇÇÇÇÇÇ6ÇÇ66666666666666ü6üüü666üüüüü6ü666666666ÇÇÇÇ6Ç6ÇÇÇÇÞÞÞÞÞÞGGGGGG         
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ         
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              

    `,
`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
AAAABBBBBBBBBBBBDBDDDDDDDFFFFFFFFHHHHHHHJJJJJJJJJLLLLLLLLLLLLLLLLLJJJJJJJJHHHHHHHHFFFFFFDDFDDDDDDBDDBBBBBBBBBBBBBBBBB         
BBBBBBBBBBBBBDDDDDDDDFFFFFFHHHHHHJJJJJJJLLLLLLLNLNNNNNNNNNNNNNNNNNNNLLNLLLLLJJJJJJHHHHHHFFFFFFDDDDDBDDBBBBBBBBBBBBBBB         
ABBBBBBBBBBDDDDDDDFFFFFHHHHHJJJJJJLLLLNNNNNNNOOOOOOOOOOBDBDDFOOOOOOOOONONNNNNLLLLLJJJJJHHHHHFFFFFFDDDDDDBBBBBBBBBBBBB         
BBBBBBBBBDDDDDDFFFFFHHHHJJJJJLLLLLNNNNNOOOOOQOQQQQQOBBBDDDHFJHHHSSQQQQQQQOOOONONNNLLLLJLJJJHHHHHFFFFFDDDDDDBBBBBBBBBB         
BBBBBBDDDDDDDFFFFFHHHHJJJJLLLLNNNNNOOOOQQQQQQQQQQQBBBDDDDBHHHHJHHHUSSSSSSSQQQQQQOONONNLLLLJJJJJHHHHFFFFDDDDDBBBBBBBBB         
BBBBBBDDDDDDFFFHHHHJJJJLLLLLNNNNOOOOOQQQQQSSSSSQQAAABBBBBDHJHJJJJLHWUUUUUUSSSSSQQQOOOOONNNLLLLJJJHHHHFFFFDDDDDDBBBBBB         
BBBDDDDDDDFFFFHHHJJJJJLLLLNNNNOOOOQQQQQSSSSSSSSSABFDBFDDBFDHJJJHJJHHWWWUWUUUUUSSSQQQQOOOONNNNLLLJJJJHHHFFFFDDDDDBBBBB         
BBBBDDDDFFFFHHHJJJJJLLLLNNNNOOOOOOQQQSSQSSUSSSSQAABBBBDFHHFONOLJLJJLJYWWWWWWUUUUUSSSSQQQOOONNNNLLLJJJHJHHFFFDDDDDDBBB         
BBDDDDDFFFFHHHHJJJJLLLNNNNNOOOQQQQQSSQSSSUUSUSSDBDBAAAAAABBAAAAAAABDFJWWWWWWWWWUUUUSSSSQQQOOOONNNLLLJJJHHHFFFFDDDDDBB         
BBDDDDFFFFHHHHJJJJLLLLLNNNOOOOQQQQSSSSSSSSUUSSAAAAAAAAAAAAAAAAAABAAAAADWWWWYWWWWUUUUUUSSQQQQOOONNNNLLLJJJHHHFFFFDDDDB         
BDDDDDFFFFHHHJJJLLLLLNNNNONOOQQQQQQQSSSSSSSSSABAAAABAAAAAAAAAAAAAAAAAAAJYWYWYWYWWWWUUUUSSSQQQQOOONNNLLLJJJHHHFFFFDDDD         
DBDDDFFFFHHHJJJJJLLLNNNNONOOOOQQQQSSSQSSSSSSUUABAAAAAAAAAAAAAAAAAAAAAAABWYYYWYWYWWWWUUUUSSSSQQQOOONNNLLLJJJHHHHFFDDDD         
BDDDDFFFHFHHHJJJLLLLLNNNOOOOQOQQQQQQQQSQSSAAAAABBAAAAAAAAAAAAAAAAAAAAABFFWYYYYYWWWWWUUUUUSSSSQQOOOONNNLLLJJJHHHFFFFDD         
DDDDDFFFFHHHJJJJJLLLNNNNNNOOOOOOQOQQQQAAAAAAAAAABAAAAAAAAAAAAAAAAAAAADFFFHFFFFYWWWWWWWUUUUSSSSQQQOOONNNLLLJJJHHHFFDFD         
BDDDDFFFFHHJHJJJLLLLLNNNNNOOOOQOOOOOAAAAAAAAAAAAABBAAAAAAAAAAAAAAAABFDFBFFDHFFFDWWWWUUUUUSUSSQQQOOONNNNLLLLJJHHHFFFDD         
DDDDDFFFFHHHHJJJJLLLLLNNNNNOOOOOOOAAAAAAAAAAAAAAAAABBAAAAAAAAAABBAFDFFDDFFAFDBDFFSUUUUUUUUSSSSQQQOOONNNLLLJJJJHHHFFFD         
BDDDDFFFFFHHHJJJJJLLLLLNNNNNNOONOAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAUUUUUUUSSSQQQQOOOONNLLLJJJJHHHFFFD         
BBDDDDFFFFHHHHJJJJLLLLLLNNNNNNNNHAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFUUSSSSSSQQQQQOOONNNLLLLJJJHHHFFFD         
BDDDDDFFFFHHHHJJJJJJLLLLLLNNNNNBBAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADDFSSSSSQQQQQOOOONNNLLLJJJJHHFFFFD         
BBDDDDDFFFFFHHHHJJJLJJLLLLLLNLAABBAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADFDDSSSSQQQQOOOONNNNLLLJJJHHHFFFDD         
BBBDDDDDFFFFFHHHHJJJJJJLJLLLDAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADDDDDDSQQQOQOOONNNNLLJJJJHHHFFFDFD         
BBBBDDDDDFFFFFHHHHHJJJJJJJLAABBBAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABBBDADQQOOOOONNNLLLJJJJHHHHFFFDDD         
BBBBBDDDDDDFFFFFHHHHHJJJJAAAAAABADAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFDFFDDBBBOONNNNLLLLJJJJHHHFFFFDDDD         
BBBBBBBDDDDDDDFFFFHHHHHHHAAAAAAAAABAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADBDDBBBBBBLNNNNLLLLJJJJHHHFFFFDDDDD         
BBBBBBBBBBDDDDDDFFFFFFHHHAAAAAAAAABABABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBAAAAAAAAAAABBBDDBBBBAANLLLJJJJJHHHHFFFFFDDDDDB         
ABBBBBBBBBBDFFHJJJJJLLLJJJHHDAAAAADAAAAAAABABBBABBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBDAAAABADSSSSSSQQSQQQOQHFFFFDDDDDDBBB         
ABABBBBBBFDFFHHHJHJJJJJJLLJLLLLJJJJAAAAAAAABBAAAABAAAAAABABBAABBBBBBBBBBBBBBBBDBBBWWWWUWUUUWUUWWUUUSSQQONNDDDDDDDBDBB         
AAABABBDDDDFFFFHHHJJJJLLJLLNNNNNNNJAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABABBABBBBBBBDOQSQSSSSSQQOQNNQONNOONJLLLJDDDBDBBB         
AAABBBBDDDDDDDDFFFHHHHJJJJLLLNNNLJBAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAABQSSSSSSSSQQQQOONNNLLLLLLLJJJHHJBBBBB         
ABBBBBBBBBBBDDDDDDDDDDDDDDDDDDDDDDDDDDDFDFFFHHHHHHHJHJHJJJHHHJJJJJHHJJJJJJLLLLLNNOOOOOOOONNNNNNLNNLNLLLLJJLJJJJHHHHBB         
BBBBBBBBBBBBBBBBDBDDDDDDDDDFFFFFFFFHHHHHHHHHHJHJJJJJJLJJLLLLLLLLLLLLLLNLNNNLLLNNNNNLNLLLLLLLLLJJJJLJLJJJJHHHHHHFFFFFF         
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA         
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              

    `,
`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
█████████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████████████████████████████████         
███████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████████████████████         
███████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████████████████         
████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████▓█▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████████████         
██████████████████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒████████▓▓▓▓▓▓▓▓░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓██████████████████         
███████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒█████████▓▓▓▓▓▓▓▓▓░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓████████████████         
██████████████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████▓▓▓▓▓▓▓▓▓░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓██████████████         
████████████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▒▒▒▒▒████████▓▓█▒▒▒▓▓▓▓▓▓▓░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████████████         
███████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░▒░▒▒██████████████████████▓░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓███████████         
██████████▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░▒▒█████████████████████████░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓█████████         
██████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████████████████▓░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓████████         
█████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░░██████████████████████████░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓██████         
████████▓█▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████████████████████████░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓██████         
█████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████████████████████████████▓████░░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓█████         
█████████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████████████████████████████████▓████░░░░░░░░░▒░▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓█████         
█████████▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒███████████████████████████████████████████████▒░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████         
██████████▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒██████████████████████████████████████████████████░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████         
██████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▓███████████████████████████████████████████████████░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓████         
██████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒███████████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓█████         
████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓█████████████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓█████         
█████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓██████         
██████████████▓▓▓▓▓▓▓▓▓▓▓▓▓███████████████████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓██████         
████████████████▓▓▓▓▓▓▓▓▓███████████████████████████████████████████████████████████████████▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓████████         
██████████████████▓▓▓▓▓▓▓███████████████████████████████████████████████████████████████████▓▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓█████████         
██████████████████████▓▓▓████████████████████████████████████████████████████████████████████▒▓▓▓▓▓▓▓▓▓▓▓▓███████████         
██████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓█████████████         
█████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████████████████████████████████████████████░░░░░░░░░░░░░░░░░▒▒▒▒▒▒▒███████████         
███████████████▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▓███████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓████████         
██████████████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▓▓███████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓▓▓▓▓▓▓▓▓▓█████         
████████████████████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▒▒▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██         
███████████████████████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▓▒▒▒▓▓▓▒▒▒▒▒▓▒▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████         
█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████         
█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              

    `,
`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
@@@@%%%%%%%%%%%%#%#######}}}}}}}}[[[[[[[]]]]]]]]])))))))))))))))))]]]]]]]][[[[[[[[}}}}}}##}######%##%%%%%%%%%%%%%%%%%         
%%%%%%%%%%%%%########}}}}}}[[[[[[]]]]]]])))))))<)<<<<<<<<<<<<<<<<<<<))<)))))]]]]]][[[[[[}}}}}}#####%##%%%%%%%%%%%%%%%         
@%%%%%%%%%%#######}}}}}[[[[[]]]]]]))))<<<<<<<>>>>>>>>>>%#%##}>>>>>>>>><><<<<<)))))]]]]][[[[[}}}}}}######%%%%%%%%%%%%%         
%%%%%%%%%######}}}}}[[[[]]]]])))))<<<<<>>>>>*>*****>%%%###[}][[[++*******>>>><><<<))))])]]][[[[[}}}}}######%%%%%%%%%%         
%%%%%%#######}}}}}[[[[]]]]))))<<<<<>>>>***********%%%####%[[[[][[[=+++++++******>><><<))))]]]]][[[[}}}}#####%%%%%%%%%         
%%%%%%######}}}[[[[]]]])))))<<<<>>>>>*****+++++**@@@%%%%%#[][]]]])[-======+++++***>>>>><<<))))]]][[[[}}}}######%%%%%%         
%%%#######}}}}[[[]]]]]))))<<<<>>>>*****+++++++++@%}#%}##%}#[]]][]][[---=-=====+++****>>>><<<<)))]]]][[[}}}}#####%%%%%         
%%%%####}}}}[[[]]]]]))))<<<<>>>>>>***++*++=++++*@@%%%%#}[[}><>)])]])]:------=====++++***>>><<<<)))]]][][[}}}######%%%         
%%#####}}}}[[[[]]]])))<<<<<>>>*****++*+++==+=++#%#%@@@@@@%%@@@@@@@%#}]---------====++++***>>>><<<)))]]][[[}}}}#####%%         
%%####}}}}[[[[]]]])))))<<<>>>>****++++++++==++@@@@@@@@@@@@@@@@@@%@@@@@#----:----======++****>>><<<<)))]]][[[}}}}####%         
%#####}}}}[[[]]])))))<<<<><>>*******+++++++++@%@@@@%@@@@@@@@@@@@@@@@@@@]:-:-:-:----====+++****>>><<<)))]]][[[}}}}####         
#%###}}}}[[[]]]]])))<<<<><>>>>****+++*++++++==@%@@@@@@@@@@@@@@@@@@@@@@@%-:::-:-:----====++++***>>><<<)))]]][[[[}}####         
%####}}}[}[[[]]])))))<<<>>>>*>********+*++@@@@@%%@@@@@@@@@@@@@@@@@@@@@%}}-:::::-----=====++++**>>>><<<)))]]][[[}}}}##         
#####}}}}[[[]]]]])))<<<<<<>>>>>>*>****@@@@@@@@@@%@@@@@@@@@@@@@@@@@@@@#}}}[}}}}:-------====++++***>>><<<)))]]][[[}}#}#         
%####}}}}[[][]]])))))<<<<<>>>>*>>>>>@@@@@@@@@@@@@%%@@@@@@@@@@@@@@@@%}#}%}}#[}}}#----=====+=++***>>><<<<))))]][[[}}}##         
#####}}}}[[[[]]]])))))<<<<<>>>>>>>@@@@@@@@@@@@@@@@@%%@@@@@@@@@@%%@}#}}##}}@}#%#}}+========++++***>>><<<)))]]]][[[}}}#         
%####}}}}}[[[]]]]])))))<<<<<<>><>@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@=======+++****>>>><<)))]]]][[[}}}#         
%%####}}}}[[[[]]]]))))))<<<<<<<<[@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@}==++++++*****>>><<<))))]]][[[}}}#         
%#####}}}}[[[[]]]]]]))))))<<<<<%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@##}+++++*****>>>><<<)))]]]][[}}}}#         
%%#####}}}}}[[[[]]])]]))))))<)@@%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#}##++++****>>>><<<<)))]]][[[}}}##         
%%%#####}}}}}[[[[]]]]]])])))#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@######+***>*>>><<<<))]]]][[[}}}#}#         
%%%%#####}}}}}[[[[[]]]]]]])@@%%%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%%%#@#**>>>>><<<)))]]]][[[[}}}###         
%%%%%######}}}}}[[[[[]]]]@@@@@@%@#@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@}#}}##%%%>><<<<))))]]]][[[}}}}####         
%%%%%%%#######}}}}[[[[[[[@@@@@@@@@%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@#%##%%%%%%)<<<<))))]]]][[[}}}}#####         
%%%%%%%%%%######}}}}}}[[[@@@@@@@@@%@%@%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%@@@@@@@@@@@%%%##%%%%@@<)))]]]]][[[[}}}}}#####%         
@%%%%%%%%%%#}}[]]]]])))]]][[#@@@@@#@@@@@@@%@%%%@%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%#@@@@%@#++++++**+***>*[}}}}######%%%         
@%@%%%%%%}#}}[[[][]]]]]]))]))))]]]]@@@@@@@@%%@@@@%@@@@@@%@%%@@%%%%%%%%%%%%%%%%#%%%----=-===-==--===++**><<#######%#%%         
@@@%@%%####}}}}[[[]]]]))]))<<<<<<<]@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%@%%@%%%%%%%#>*+*+++++**>*<<*><<>><])))]###%#%%%         
@@@%%%%########}}}[[[[]]]])))<<<)]%@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@%*++++++++****>><<<)))))))]]][[]%%%%%         
@%%%%%%%%%%%###########################}#}}}[[[[[[[][][]]][[[]]]]][[]]]]]])))))<<>>>>>>>><<<<<<)<<)<))))]])]]]][[[[%%         
%%%%%%%%%%%%%%%%#%#########}}}}}}}}[[[[[[[[[[][]]]]]])]]))))))))))))))<)<<<)))<<<<<)<)))))))))]]]])])]]]][[[[[[}}}}}}         
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@         
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              

    `,
`

                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
                                                                                                                                       
000000000000000080888888899999999999999966666666644444444444444444666666669999999999999988988888808800000000000000000         
000000000000088888888999999999999666666644444445455555555555555555554454444466666699999999999988888088000000000000000         
000000000008888888999999999966666644445555555555555555508088955555555555555554444466666999999999998888880000000000000         
000000000888888999999999666664444455555555552522222500088899699933222222255555555544446466699999999998888880000000000         
000000888888899999999966664444555555555222222222220008888099996999333333332222225555554444666669999999988888000000000         
000000888888999999966664444455555555522222333332200000000896966664913333333333322255555555444466699999999888888000000         
000888888899999996666644445555555522222333333333009809880989666966991113133333333222255555555444666699999998888800000         
000088889999999666664444555555555522233233333332000000899995554646646711111133333333322255555554446669699999888888000         
008888899999999666644455555555222223323333333338080000000000000000089611111111133333333222555555544466699999998888800         
008888999999996666444445555555222233333333333300000000000000000000000081111711113333333322225555555444666999999988880         
088888999999966644444555555552222222333333333000000000000000000000000006717171711113333333222255555544466699999998888         
808889999999666664445555555555222233323333333300000000000000000000000000177717171111333333332225555554446669999998888         
088889999999966644444555555525222222223233000000000000000000000000000009917777711111333333333225555555444666999999988         
888889999999666664445555555555552522220000000000000000000000000000000899999999711111113333333322255555544466699999898         
088889999996966644444555555555255555000000000000000000000000000000009890998999981111333333333222555555544446699999988         
888889999999966664444455555555555500000000000000000000000000000000989988990980899333333333333322255555544466669999998         
088889999999966666444445555555555000000000000000000000000000000000000000000000000003333333333222255555544466669999998         
008888999999996666444444555555559000000000000000000000000000000000000000000000000009333333332222255555544446669999998         
088888999999996666664444445555500000000000000000000000000000000000000000000000000008893333322222555555544466669999998         
008888899999999966646644444454000000000000000000000000000000000000000000000000000008988333322225555555544466699999988         
000888889999999996666664644480000000000000000000000000000000000000000000000000000008888883222525555555446666999999898         
000088888999999999966666664000000000000000000000000000000000000000000000000000000000000808225555555544466669999999888         
000008888889999999999666600000000800000000000000000000000000000000000000000000000009899880005555554444666699999998888         
000000088888889999999999900000000000000000000000000000000000000000000000000000000080880000004555544446666999999988888         
000000000088888899999999900000000000000000000000000000000000000000000000000000000000088000000544466666999999999888880         
000000000008999666664446669980000080000000000000000000000000000000000000000000000800000083333332232225299999888888000         
000000000989999969666666446444466660000000000000000000000000000000000000000000800011113133313311333332255588888880800         
000000088889999999666644644555555560000000000000000000000000000000000000000000000852323333322525525555556444688808000         
000000088888888999999966664445554600000000000000000000000000000000000000000000000233333333222255555444444466699600000         
000000000000888888888888888888888888888989999999999696966699966666996666664444455555555555555554554544446646666999900         
000000000000000080888888888999999999999999999696666664664444444444444454555444555554544444444466664646666999999999999         
000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000         
000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000         
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              
                                                                                                                              

    `,
  `




  /$$      /$$           /$$                                                   /$$$$$$$$                                               
| $$  /$ | $$          | $$                                                  |__  $$__/                                               
| $$ /$$$| $$  /$$$$$$ | $$  /$$$$$$$  /$$$$$$  /$$$$$$/$$$$   /$$$$$$          | $$  /$$$$$$                                         
| $$/$$ $$ $$ /$$__  $$| $$ /$$_____/ /$$__  $$| $$_  $$_  $$ /$$__  $$         | $$ /$$__  $$                                        
| $$$$_  $$$$| $$$$$$$$| $$| $$      | $$  \ $$| $$ \ $$ \ $$| $$$$$$$$         | $$| $$  \ $$                                        
| $$$/ \  $$$| $$_____/| $$| $$      | $$  | $$| $$ | $$ | $$| $$_____/         | $$| $$  | $$                                        
| $$/   \  $$|  $$$$$$$| $$|  $$$$$$$|  $$$$$$/| $$ | $$ | $$|  $$$$$$$         | $$|  $$$$$$/                                        
|__/     \__/ \_______/|__/ \_______/ \______/ |__/ |__/ |__/ \_______/         |__/ \______/                                         
                                                                                                                                      
                                                                                                                                      
                                                                                                                                      
  /$$$$$$   /$$$$$$   /$$$$$$             /$$$$$$   /$$           /$$$$$$$$                                /$$                     /$$
 /$$__  $$ /$$__  $$ /$$__  $$           /$$__  $$ | $$          |__  $$__/                               |__/                    | $$
| $$  \ $$| $$  \ $$| $$  \__/  /$$$$$$ | $$  \__//$$$$$$           | $$  /$$$$$$   /$$$$$$  /$$$$$$/$$$$  /$$ /$$$$$$$   /$$$$$$ | $$
| $$$$$$$$| $$$$$$$$|  $$$$$$  /$$__  $$| $$$$   |_  $$_/           | $$ /$$__  $$ /$$__  $$| $$_  $$_  $$| $$| $$__  $$ |____  $$| $$
| $$__  $$| $$__  $$ \____  $$| $$  \ $$| $$_/     | $$             | $$| $$$$$$$$| $$  \__/| $$ \ $$ \ $$| $$| $$  \ $$  /$$$$$$$| $$
| $$  | $$| $$  | $$ /$$  \ $$| $$  | $$| $$       | $$ /$$         | $$| $$_____/| $$      | $$ | $$ | $$| $$| $$  | $$ /$$__  $$| $$
| $$  | $$| $$  | $$|  $$$$$$/|  $$$$$$/| $$       |  $$$$/         | $$|  $$$$$$$| $$      | $$ | $$ | $$| $$| $$  | $$|  $$$$$$$| $$
|__/  |__/|__/  |__/ \______/  \______/ |__/        \___/           |__/ \_______/|__/      |__/ |__/ |__/|__/|__/  |__/ \_______/|__/
                                                                                                                                      
                                                                                                                                      
                                                                                                                                      



`]

if(this.isAllowed){
 frameAnimation=setInterval(()=>{
  if(this.isAllowed){
    let num=Math.floor(Math.random() * frames.length-1)
  let ran=frames[num]?frames[num]:frames[0]
  document.querySelectorAll('pre')[0].innerHTML=ran.trim()
}

},60)
}
let orders=[]
      let commands={
        help:[
        `<span class='glow'>whoami</span> -<span class='help'> A Brief Description of Me and This Website's Purpose! 🙋‍♂️</span> <br/>`,
        `<span class='glow'>projects</span> -<span class='help'> Seriously! 😐 You Needed help for this to figure it out????????? </span> <br/>`,
        `<span class='glow'>help</span> - <span class='help'>All Commands' Help! 🙏 </span><br/>`,
        "<span class='glow'>clear</span> - <span class='help'>Erase All Previous Commands 🧹 </span><br/>",
        "<span class='glow'>stopAnimation</span> - <span class='help'>This will Stop this Ascii Animation 👊</span><br/>",
        "<span class='glow'>startAnimation</span> - <span class='help'>Let's go make some Animation again! 👋</span><br/>",
        "<span class='glow'>socialMedia</span> - <span class='help'>My Social Media Links 📱</span><br/>",
        "<span class='glow'>myEmail</span> - <span class='help'>My Email... 💌</span><br/>",
        "<span class='glow'>contact</span> - <span class='help'>Contact Me Via A Google Form ! ✍️</span><br/>",
        "<span class='glow'>whyNetflix</span> - <span class='help'>Find out about this Page's Intro... (Copy of codepen 👉 https://codepen.io/claudio_bonfati) </span><br/>",
        "<span class='glow'>game</span> - <span class='help'>An awesome game to play! 🎮🎲🎮</span><br/>",
        "<span class='hack'>morseEncode</span> - <span class='help'>A tool to encode text to morse code and also decode it with morseDecode make sure after command type the text , it gives an audio too 🔊</span><br/>",
        "<span class='glow'>joke</span> - <span class='help'>Tells you a geek joke 😉</span><br/>",
        "<span class='glow'>quote</span> - <span class='help'>Tells you a Great Quote 🙃</span><br/>",
        "<span class='glow'>weather</span> - <span class='help'>Tells you Weather of a city - please provide a correct city name after weather 🌧️</span><br/>",
        "<span class='hack'>exit || kill</span> - <span class='help'>closes the terminal 😢 </span><br/>",
        "<span class='hack'>sudo😈</span> - <span class='help'>DO NOT RUN THIS 🤚 </span><br/>",
        "<span class='glow'>LINUX COMMANDS</span> - <span class='help'>If you know any run!🙆‍♂️ </span><br/>",
        
      ],
      whoami: [
  `<span class='help'>Greetings! 🌟 I'm Alireza Mohebbi, a 20-year-old enthusiast on a thrilling journey of learning and mastering the art of programming. 🚀</span>`,
  `<span class='help'>My passion lies in the dynamic realm of Web Development, where I weave digital wonders with lines of code. 💻✨</span>`,
  `<span class='help'>You're in for a treat – explore my digital universe at <a target='_blank' class='link' href='https://aasoft.ir'>AASOFT</a>. Brace yourself for a visually captivating experience! 👀</span>`,
  `<span class='help'>But wait, there's more! I'm not just coding; I'm crafting solutions, pushing boundaries, and making the digital world a more exciting place. 🌐🚀</span>`,
  `<span class='help'>Dive into the world of endless possibilities with a click! Your support is my fuel </span>`,
  `<span class='help'> – explore, engage, and wish me luck on this incredible coding odyssey! 🙌🚀</span>`
],

        stopAnimation:null,
        startAnimation:null,
        contact:null,
        clear:null,
        joke:null,
        quote:null,
        exit:null,
        kill:null,
        weather:null,
        myEmail:null,
        sudo:null,
        game:null,
        socialMedia:[
        `<span class='glow'>Connect with us directly for swift communication!</span>`,
        `<span > Drop us a message on Telegram <i class='fab fa-telegram glow'></i> at <span class='hack'> @aasoft_2003</span> . We believe in fostering genuine connections,</span>`,
        `<span > prioritizing direct interaction over social media noise. Your messages matter, and we're here to listen, </span>`,
        `<span >respond, and engage with you promptly. Let's keep it personal, efficient, </span>`,
        `<span >and Telegram-exclusive. Thank you for understanding our choice to focus on meaningful conversations.</span>`  
      ],
        whyNetflix: [
  `<span class='help'>Ever wondered why Netflix looks so sleek? Well, I have a confession to make... 🤭 </span>`,
  `<span class='help'>I shamelessly borrowed the entire style from a talented developer on CodePen!</span>`,
  `<span class='help'> Check out <a href='https://codepen.io/claudio_bonfati' target='_blank' class='link'>Claudio Bonfati's page</a> for the real magic! 👌</span>`,
],

projects: [
  `<span class='glow'>Hold on to your seat! 🚀 While I may not have an overflowing GitHub with countless projects (yet), the ones I have are pure awesomeness! 🤘</span>`,
  `<span class='glow'>Picture this: A website that's a blend of creativity and innovation. That's the kind of projects I'm into! 🎨💻</span>`,
  `<span class='glow'>Okay, okay, I confess! Some projects weren't born solely from my brain, but they're like my digital babies, nurtured and polished with love. ❤️</span>`,
  `<span class='glow'>For the grand reveal, dive into my digital playground at 👉 <a href='https://aasoft.ir' target='_blank' class='link'>AASOFT</a>. Prepare to be amazed! 🌐</span>`
],

ls:null,
cd:null,
pwd:null,
cat:null,
touch:null,
rm:null,
echo:null,    
morseEncode:null,    
morseDecode:null,    

      }
      function log(str){
      let terminal= document.querySelector('#terminal')
      let wrapper=document.createElement('div')
      let demo=document.createElement('div')
      wrapper.setAttribute('class','wrapper')
      demo.setAttribute('class','typing-demo')
      demo.innerHTML='&nbsp;&nbsp;&nbsp;&nbsp;'+str.trim()
      wrapper.appendChild(demo)
      terminal.insertBefore(wrapper,document.querySelector('.type'))

      terminal.scrollTop=terminal.scrollHeight
    }

    function command(cmd){
      let c=cmd.trim()
      if(commands[c]){
        commands[c].forEach((com,i)=>{
            setTimeout(()=>{
            log(com)
            },i*300)

            if(i==commands[c].length-1){
              document.addEventListener('keydown', keydownHandler);
            }
        })
      }else{
        log(`Command Not Found!🚫 - ➡️ tpye 'help' for commands ⬅️`)
        document.addEventListener('keydown', keydownHandler);


      }
    }

    function clear(){
      let ar=document.querySelectorAll("#terminal > div:not(.type)")
          ar.forEach((e)=>{
            !e.classList.contains('frame')? e.remove():''
           
           })
      }
      
    function keydownHandler(e) {

  if (document.querySelector('.sufix').classList.contains('blink')) {
    if ((e.keyCode >= 40 && e.keyCode < 126)|| e.keyCode==190|| e.keyCode==173) {
      document.querySelector('.terminal-text').innerText += e.key;
    } else if (e.key === 'Backspace') {
      let text = document.querySelector('.terminal-text').innerText;
      text = text.length > 0 ? Array.from(text.split('')) : '';
      text.length>0?text.pop():'';
      document.querySelector('.terminal-text').innerText = text.length>0?text.join(''):'';
    } else if (e.key === 'Enter' && document.querySelector('.terminal-text').innerText.trim().length>0 ) {
      let mom = document.createElement('div');
      mom.classList.add('input-line');
      let child = document.createElement('span');
      let child2 = document.createElement('span');
      child.innerText = document.querySelector('.terminal-text').innerText;
      child2.innerHTML = '$&nbsp;';
      child2.classList.add('input-prefix');
      child2.setAttribute('style','color:green')
      mom.appendChild(child2);
      mom.appendChild(child);
      mom.setAttribute('style','text-align:left')
      let order=document.querySelector('.terminal-text').innerText.trim()
      console.log(order)
      orders.push(document.querySelector('.terminal-text').innerText)
      document.querySelector('.terminal-text').innerText = '';

        document.querySelector('#terminal').insertBefore(
        mom,
        document.querySelector('#terminal').children[
          document.querySelector('#terminal').children.length - 1
        ]
      );
    
      
      if(order =='clear'){
        clear()
      }else if (order =='stopAnimation'){
        clearInterval(frameAnimation)
        frameAnimation=null
        document.querySelectorAll('pre')[0].innerHTML=`<pre>${frames[frames.length-1].trim()}</pre>`
      }else if (order =='startAnimation'){
        if(!frameAnimation){
          frameAnimation=setInterval(()=>{
          let num=Math.floor(Math.random() * frames.length-1)
          let ran=frames[num]?frames[num]:frames[0]
          document.querySelectorAll('pre')[0].innerHTML=ran.trim()
        },50)

        }
      }else if(order =='contact'){
        let uuid=crypto.randomUUID()
        log(`<span id='${uuid}'>&nbsp;&nbsp;&nbsp; Opening the Form... Be Patient </span>`)
        setTimeout(()=>{
          document.querySelectorAll('.modal')[0].classList.toggle('open')
          document.querySelectorAll('.modal')[0].classList.toggle('hide')
          document.getElementById(uuid).innerText='Form Opened...'
        },2000)
      }
      else if(order =='joke'){
        let id=crypto.randomUUID()
        let idText=crypto.randomUUID()
      log(`<span id='joke${id}'>&nbsp;&nbsp;&nbsp; Getting a joke Wait a Second.... 😆</span>`)
      setTimeout(()=>{
        fetch('https://geek-jokes.sameerkumar.website/api?format=json').then((e)=>e.json()).then((el)=>{
          document.getElementById(`joke${id}`).parentElement.parentElement.remove()
          log(`<span id='joke${idText}' class='help' style='font-size:25px;margin-left:15px'>${el.joke} 🤣</span>`)
          setTimeout(function(){
            const spanWidth = document.getElementById(`joke${idText}`).offsetWidth
          const windowWidth = window.innerWidth;
          if(spanWidth>= windowWidth){
            let overflowText=document.getElementById(`joke${idText}`).innerText.split(' ')
            let index=overflowText.length-Math.floor(overflowText.length/3)
            let oneThird=overflowText.slice(0,index)
            let twoThird=overflowText.slice(index)
            oneThird.push('<br>&nbsp;&nbsp;&nbsp;')
            let re=[...oneThird,...twoThird].join(' ')
            document.getElementById(`joke${idText}`).innerHTML=re
          }
          },2000)

        }).catch(()=>{
          log('ERROR Can\'t Load Joke!!!')
        })
      },1000)
      }else if(order == 'myEmail'){
        log('Really You Wanna Email Me?? 😎')
        setTimeout(()=>{
          log('Please Don\'t 🙏')
          log('Going To My Mail...')
        },1000)

        setTimeout(()=>{
          window.open('mailto: aasoftmohebbi@gmail.com', '_blank');
        },3000)
      }else if(order=='quote'){
        let id=crypto.randomUUID()
        let id2=crypto.randomUUID()
        log(`<span id='${id}'>Loading Quote Please Wait...</span>`)
        setTimeout(()=>{
          let quotes=fetch('https://stoic.tekloon.net/stoic-quote').then((e)=>e.json()).then((data)=>{
            document.getElementById(id).parentElement.parentElement.remove()
            log(`<span class='help' id='quote${id2}'>${data.quote} <em> - ${data.author}</em></span>`)

            setTimeout(function(){
            const spanWidth = document.getElementById(`quote${id2}`).offsetWidth
          const windowWidth = window.innerWidth;
          if(spanWidth>= windowWidth){
            let overflowText=document.getElementById(`quote${id2}`).innerText.split(' ')
            let index=overflowText.length-Math.floor(overflowText.length/3)
            let oneThird=overflowText.slice(0,index)
            let twoThird=overflowText.slice(index)
            oneThird.push('<br>&nbsp;&nbsp;&nbsp;')
            let re=[...oneThird,...twoThird].join(' ')
            document.getElementById(`quote${id2}`).innerHTML=re
          }
          },1500)
          }).catch((err)=>[
            log(err)
          ])
        },2000)
      }else if(order.startsWith('weather')){
        let id=crypto.randomUUID()
        log(`<span id='${id}'>Looking for Location...</span>`)
        if(order.split(' ').length == 2){
          fetch(`https://weather.visualcrossing.com/VisualCrossingWebServices/rest/services/timeline/${order.split(' ')[1].trim()}/?key=UC8DGVVFV4ATYM3JSWA3C7DS3`).then((e)=>e.json()).then((city)=>{
            document.getElementById(id).parentElement.parentElement.remove()
            log(`<span class='help'>${city.description}<i class='fa fa-${city.currentConditions.icon}'></i></span>`)
            setTimeout(()=>log("<span class='glow'>Temp: "+city.currentConditions.temp+"</span>"),500)
            setTimeout(()=>log(`<span class='help'>Condition: ${city.currentConditions.conditions}</span>`),1000)
            console.log(city,city.currentConditions)
          }).catch((err)=>{
            document.getElementById(id).parentElement.parentElement.remove()
            console.log(err)
        })
        }else{
          log("<span class='hack'>"+'Wrong input! Please Write As help says!'+"</span>")
        }
      }else if(order=='sudo'){
        log(`<span class='hack'> So You Finally ran This? </span>`)
        setTimeout(()=>log(``),2000)
        setTimeout(()=>log(`<span class='hack'>  I'm Sorry But...</span>`),4000)
        setTimeout(()=>log(``),5000)
        setTimeout(()=>{
          console.log(document.querySelectorAll('pre')[0])
          document.querySelectorAll('pre')[0].style.color='red'
          document.querySelectorAll('.type span')[0].style.color='red'
          log(`<span class='hack' style='font-size:40px'>  You Are Gonna Be HACKED 😱</span>`)
        },7000)
        setTimeout(()=>{
          for(let i=0;i<10;i++){
            log('')
          }
        },9000)
        setTimeout(()=>{
          log(`<span>🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣</span>
        `)
        document.querySelectorAll('pre')[0].style.color='white'
          document.querySelectorAll('.type span')[0].style.color='lime'
      },12000)
      }
      else if (order.startsWith('cd')) {
    const cdRegex = /^cd\s+(\S+)$/; // Regular expression for "cd" command with a non-whitespace argument
    const match = order.match(cdRegex);

    if (match) {
        const directoryName = match[1];

        if (!directoryName.startsWith('..')) {
            setTimeout(() => {
                log(`<span class='help'>Teleporting to the land of unicorns... </span>`);
                setTimeout(() => {
                    log(`<span class='help'>You're now in <span class='glow'>${directoryName}</span></span>`);
                    let text = document.querySelector('.type .input-prefix').innerText.split(' ');
                    document.querySelector('.type .input-prefix').innerText = text[0] + `/${directoryName} ` + text.slice(2).join(' ')+' ~$';
                }, 1500);
            }, 400);
        } else {

            let ans = document.querySelector('.type .input-prefix').innerText.split('/');
          if(ans.length>1){
            ans.pop()
            document.querySelector('.type .input-prefix').innerText = ans.join('/')+' ~$';
          }

        }
    } else {
        log("<span class='hack'>" + 'Wrong input! Where do you want to go???' + "</span>");
    }
}else if(order=='ls'){

  files.forEach((file,i)=>{
    setTimeout(()=>{
      log(`<span class='hack'>${file}</span>`)
    },i*200)
  })

}else if(order.startsWith('touch')){
  let str=order.split(' ')
  if(str.length == 2){
    files.includes(str[1].trim())?log(`<span class='hack'>repeated file!</span>`): files.push(str[1].trim())

  }else {
        log("<span class='hack'>" + 'Wrong input! Where do you want to go???' + "</span>");
  }



}else if(order.startsWith('cat')){
  let str=order.split(' ')
  if(str.length==2){
    if(files.includes(str[1].trim())){
      switch(str[1].trim()){
        case 'donot.readme': 
        log(`<span class='hack'>I Said Do Not Read Me 😠😠😠😠😠😠😠</span>`)
        break;
        case 'aasoft.ir': 
        log(`<span class='hack'>Let's Go There...</span>`)
        window.open('https://aasoft.ir', '_blank');
        break;
        case 'projects.me': 
        commands.projects.forEach((str,i)=>{
          setTimeout(()=>log(str),i*300)
        })
        break;
        case 'hack.me': 
        log(`<span class='hack'>d0 r34lly w4nt m3 70 h4ck y0u??????</span>`)
        setTimeout(()=>log(`<span class='hack'>0k bu7 y0u w4nt3d 1t</span>`),200)
        for(let i=1;i<=17;i++){
          setTimeout(()=>log(`?`),i*900)
          if(i ==12){
            setTimeout(()=>{
              log(`<span class='glow'>5h4m3 0n y0u 1 4m n07 4 ch34p h4ck3r 1 4m 4n 37h1c41 h4ck3r</span>`)
          setTimeout(()=>log(`<span >😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒</span>`),1500)


            },i*1000)
          }
        }
        break;
        case 'virus.vbs': 
        let br=''
        for(let i=0;i<=24;i++){
          setTimeout(()=>{
            log(`${br}<span class='hack'>💀</span>`)
            br+='&nbsp;&nbsp;&nbsp;&nbsp;'
              document.querySelector('#terminal').style.backgroundColor='#'+Math.floor(Math.random()*16777215).toString(16)
            if(i==24){
              document.querySelector('#terminal').style.backgroundColor='#041a00'
            }
        },i*400)
        }
        break;
        default:
        log(`<span class='help'>${str[1]} is Empty!</span>`)
        break
      }
    }else{
      log(`<span class='help'>there is no file or directory</span>`)

    }
  }else {
        log("<span class='hack'>" + 'Wrong input! Where do you want to go???' + "</span>");
  }

}else if(order.startsWith('echo')){
let str=order.split(' ')
if(str.length == 2){
  log(`"${str[1].trim()}"`)

}else{
  log(`wrong input!`)
}
}else if(order.startsWith('rm')){
  let str=order.split(' ')
if(str.length == 2){
let f=str[1].trim()
if(files.includes(f)){
 files.splice(files.indexOf(f),1)
}

}
else{
  log(`wrong input!`)
}
}

else if(order=='pwd'){
log(`<span class='help'>The path is /home/user/aasoft.ir/${document.querySelector('.type').textContent.replace('~$','').replace('|','')}</span>`)
}
else if(order.trim()=='game'){
  log("&nbsp;&nbsp;&nbsp; Opening the Game... Be Patient ")
        setTimeout(()=>{
          document.querySelectorAll('.modal')[1].classList.toggle('open')
          document.querySelectorAll('.modal')[1].classList.toggle('hide')
          
        },2000)
}else if(order.startsWith('morseEncode')||order.startsWith('morseDecode')){
  let str=order.trim().split(' ')
if(str.length == 2&&str[0]=='morseEncode'){
  let text=str[1].trim().replace(/^W/,'')
  console.log(text)
    log("<span class='hack' style='font-size:20px'>"+Morse.encode(text)+"</span>")
    Morse.play(text)
    Morse.download({message:text})

}else if(order.startsWith('morseDecode')){
  str.splice(0,1)
  let s=''
  str.forEach((ch)=>{
    s+=Morse.decode(ch).trim()
  })
  log("<span class='hack' style='font-size:18px'>"+s.trim()+"</span>")


}
else{
  log(`wrong input!`)
}
}else if(order.startsWith('exit')||order.startsWith('kill')){
  let uuid=crypto.randomUUID()
  log(`<span class='hack' style='font-size:150px;margin-left:250px' id='${uuid}'>6</span>`)
  let interval=setInterval(()=>{
    let val=parseInt(document.getElementById(uuid).innerText)
    if(val>0){
      document.getElementById(uuid).innerText=val-1
    }else{
      clearInterval(interval)
      window.location.reload()
    }
  },1150)
}
      
else{
        document.removeEventListener('keydown', keydownHandler);
        command(order)
      }
    }else if(e.key=='Tab'){
      let order=document.querySelector('.terminal-text').innerText
      e.preventDefault();
      const matchingCommands = Object.keys(commands).filter(command =>
          command.startsWith(order)
        );

        if (matchingCommands.length > 0) {
          // Autocomplete with the first matching command
          document.querySelector('.terminal-text').innerText = matchingCommands[0];
        }
    }else if((e.key=='ArrowRight' || e.key=='ArrowLeft')&&!frameAnimation){
        let num=Math.floor(Math.random()*frames.length)
        document.querySelectorAll('pre')[0].innerHTML=frames[num].trim()
      
    }else if((e.key=='ArrowUp')){
      let q=document.querySelector('.terminal-text').innerText.trim();
      if(q&&orders.indexOf(q)){
        let i=orders.indexOf(q)-1
        orders[i]?document.querySelector('.terminal-text').innerText=orders[i]:document.querySelector('.terminal-text').innerText=''
      }else{
        document.querySelector('.terminal-text').innerText=orders[orders.length-1]
      }
    } 
    
    
    if((e.key=='F12')){
      console.log('F12 Pressed!')
      e.preventDefault()
      return false
    }
    if(e.code=='Space'){
      document.querySelector('.terminal-text').innerHTML+=' '+'&nbsp;'

    }


  }
}
document.addEventListener('DOMContentLoaded', function () {
  window.addEventListener('focus', function (ee) {
    document.removeEventListener('keydown', keydownHandler);
    document.querySelector('.sufix')?.classList.remove('hide');
    document.querySelector('.sufix')?.classList.add('blink');
    document.addEventListener('keydown', keydownHandler);
  });

  window.addEventListener('blur', function () {
    document.removeEventListener('keydown', keydownHandler);
    document.querySelector('.sufix')?.classList.add('hide');
    document.querySelector('.sufix')?.classList.remove('blink');
  });
});
document.querySelectorAll('.backdrop').forEach((el)=>{
el.addEventListener('click',()=>{
  el.parentElement.classList.add('hide')
  el.parentElement.classList.remove('open')
})
})

},
  
}
</script>

<style>

.gameHidden{
display:none !important;
}
.help{
  text-shadow: 0px 0px 6.5px   rgb(4, 167, 4) !important;
}
.glow{
  text-shadow: 0px 0px 6.5px #1d61f3 !important;
  color:#1d61f3 !important;
}


.hack{
  text-shadow: 0px 0px 10px #d6250e !important;
  color:#d6250e !important;
}
::selection {
  background-color: #005e00; /* Change this to your desired background color */
  color: #ffffff; /* Change this to your desired text color */
}
body,html{
  margin:0 ;
}
#app {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}


.wrapper {
  height: fit-content;
  /*This part is important for centering*/
  display: grid;
  place-items: left;
  margin: 2.5px 0;
}

.typing-demo {
  text-align: left;
  width: 100%;
  animation: typing 1.5s steps(90);
  word-break: break-all;
  overflow: hidden;
  font-family: monospace;
  font-size: 18px;
  color: rgb(4, 167, 4);
  word-wrap: break-word;
  height: fit-content;
  white-space: nowrap;
}

@keyframes typing {
  from {
    width: 0
  }
}

@keyframes pulse {
  from{
  text-shadow: 0px 0px 1px #1d61f3 !important;
  opacity:0.9


  }
to{
  text-shadow: 0px 0px 50px #1d61f3 !important;
  opacity:0.3
}

}



.link{
text-decoration: none;
font-family: "Protest Revolution", sans-serif !important;
animation:pulse 1.5s infinite alternate ;
text-shadow: 0px 0px 5px #1d61f3 !important;
color:#1d61f3 !important;
}

.modal.hide{
  display:none;
  opacity:0
}
.modal.open{
  display:block;
  opacity:1
}
.modal:not(.game){
  position: fixed;
  top:0;
  left:0;
  overflow-y:scroll
}
.modal .backdrop{

  width:100vw;
  height:100vh;
  background: #005e00;
  opacity:0.6;
  z-index: 50;
  transition: all 2s linear;
}
.modal:not(.game) iframe{
  position: absolute;
  top:5%;
  left:28%;
  height: 80vh !important;
  padding:5px;
  vertical-align: middle;
  z-index: 100;
  overflow-y:scroll;
  background:whitesmoke;
  border-radius: 20px;
}
.game{
  position: fixed;
  top:0;
  left:0;
}
.game iframe{
  position: absolute;
  top:20vh;
  left:8.5vw;
  height: 400px !important;
  padding:5px;
  vertical-align: middle;
  z-index: 100;
  overflow-y:scroll;
  background:whitesmoke;
  border-radius: 20px;
  overflow: hidden;
}
</style>
